const questions = [
		{
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 2,
			"type": "Правило суммы",
			"description": "Описание рекомендации",
			"text": "В магазине семь видов шоколадных конфет и десять видов карамелек. Сколькими способами можно выбрать три конфеты одного вида?",
			"type_answer": "one",
			"checker": "17,15,16,18",
			"description": ""
		},
		{
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 1,
			"type": "Правило суммы",
			"text": "На 8 марта мальчики вашего класса решили подарить девочкам по красивой розе. Сколько различных 	букетов из одной розы можно составить, если в магазине есть 20 белых и 15 кремовых роз?",
			"type_answer": "many",
			"checker": "35,38,34;36",
			"description": ""
		},
		{   
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 1,
			"type": "Правило суммы",
			"text": "На подносе лежат пять яблок и три груши. Сколькими способами можно выбрать фрукт с подноса?",
			"type_answer": "open",
			"checker": "8",
			"description": ""
		},											
		{   
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 1,
			"type": "Правило суммы",
			"text": "На полке стоят десять томов Пушкина, четыре тома Лермонтова и шесть томов Гоголя. Сколькими способами можно выбрать с полки книгу?",
			"type_answer": "one",
			"checker": "20,21,22,19",
			"description": "Описание рекомендации"
		},	
		{   
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 1,
			"type": "Правило произведения",
			"text": "В футбольной команде (11 человек) нужно выбрать капитана и его заместителя. Сколькими способами это можно сделать? ",
			"type_answer": "many",
			"checker": "114,110;100,120",
			"description": "Описание рекомендации"
		},
		{   
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 1,
			"type": "Правило суммы",
			"text": "У людоеда в подвале томятся 10 пленников. Сколькими способами он может выбрать по одному себе на завтрак, обед и ужин?",
			"type_answer": "open",
			"checker": "720",
			"description": "Описание рекомендации"
		},
		{   
			"part": "Комбинаторика",
			"sections": "Выборки",
			"subsections": "Правило суммы и произведения",
			"Complexity": 1,
			"type": "Правило суммы",
			"text": "На почте пять видов конвертов и восемь видов марок. Сколькими способами можно выбрать один конверт и одну марку для отправки письма?",
			"type_answer": "one",
			"checker": "40,30,50,10",
			"description": "Описание рекомендации"
		},		
	]
	



const part = [
		{
			"title": "Комбинаторика",
			"sections":[
				{
			  "title": "Выборки",
			  "subsections": [
				{
				  "title": "Правило суммы и произведения",
							"complexity":[
								{
									"idComplexity": 1,	
									"description": "Описание рекомендации",
									"types": [
										{
											"title": "Правило суммы",
											"number": 2,
											"description": "Описание рекомендации",
										},
										{
											"title": "Правило произведения",
											"number": 2,
											"description": "Описание рекомендации",
										},
										{
											"title": "Задачи с числами",
											"number": 2,
											"description": "Описание рекомендации",
										},
										{
											"title": "Количество делителей",
											"number": 1,
											"description": "Описание рекомендации",
										},
									]
								},
								{
									"idComplexity": 2,	
									"description": "Описание рекомендации",
									"types": [
										{
											"title": "Нечисловые данные в правиле произведения",
											"number": 2,
											"description": "Описание рекомендации",
										}
									]		
								}
							]
						}
					]
				}
			]
		}
	]